Catalogs/ГруппыВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ГруппыВиджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Схема</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Виджет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Виджеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПозицияКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Виджеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Виджеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаВиджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоказателейДляВывода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаВиджета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательПодвала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяВМатрицеТалантов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОсновныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиВиджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПоказателиВиджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПоказателиВиджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияВиджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыВиджетов/Forms/ФормаРедактированияВиджетов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ИмяПредопределенныхДанных <> "МатрицаТалантов" Тогда
		Элементы.ФормаУстановитьСтандартныеНастройки.Видимость = Ложь;
	КонецЕсли;
	
	СформироватьВиджетыНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьДанные(Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ЦветВиджетаПриИзменении(Элемент)
	
	Элемент.Родитель.ЦветФона = ЭтотОбъект[Элемент.Имя];
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Отказ = Ложь;
	ЗаписатьДанные(Отказ);
	Модифицированность = Ложь;
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартныеНастройки(Команда)
	
	СветлоОранжевый = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветВиджетаСветлоОранжевый");
	СветлоЗеленый = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветВиджетаСветлоЗеленый");
	Зеленый = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветВиджетаЗеленый");
	Оранжевый = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветВиджетаОранжевый");
	Красный = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветВиджетаКрасный");
	
	ШрифтЗаголовка = ОбщегоНазначенияКлиент.ШрифтСтиля("ШрифтЗаголовкаВиджета");
	ШрифтДанных = ОбщегоНазначенияКлиент.ШрифтСтиля("ШрифтДанныхВиджета");
	ЗаполнитьДанныеВиджета("1_1", НСтр("ru = 'Потенциально ценный'"), СветлоОранжевый);
	ЗаполнитьДанныеВиджета("2_1", НСтр("ru = 'Потенциальная звезда'"), СветлоЗеленый);
	ЗаполнитьДанныеВиджета("3_1", НСтр("ru = 'Звезда'"), Зеленый);
	ЗаполнитьДанныеВиджета("1_2", НСтр("ru = 'Непостоянный сотрудник'"), Оранжевый);
	ЗаполнитьДанныеВиджета("2_2", НСтр("ru = 'Основной сотрудник'"), СветлоОранжевый);
	ЗаполнитьДанныеВиджета("3_2", НСтр("ru = 'Высокопроизводительный'"), СветлоЗеленый);
	ЗаполнитьДанныеВиджета("1_3", НСтр("ru = 'Зона риска'"), Красный);
	ЗаполнитьДанныеВиджета("2_3", НСтр("ru = 'Рядовой сотрудник'"), Оранжевый);
	ЗаполнитьДанныеВиджета("3_3", НСтр("ru = 'Надежный исполнитель'"), СветлоОранжевый);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьВиджетыНаФорме()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыВиджетовСхема.Виджет КАК Виджет,
		|	ВиджетыОсновныеПоказатели.Показатель КАК Показатель,
		|	ГруппыВиджетовСхема.ПозицияСтроки КАК ПозицияСтроки,
		|	ГруппыВиджетовСхема.ПозицияКолонки КАК ПозицияКолонки
		|ПОМЕСТИТЬ ВиджетыГруппы
		|ИЗ
		|	Справочник.ГруппыВиджетов.Схема КАК ГруппыВиджетовСхема
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Виджеты.ОсновныеПоказатели КАК ВиджетыОсновныеПоказатели
		|		ПО ГруппыВиджетовСхема.Виджет = ВиджетыОсновныеПоказатели.Ссылка
		|			И (ВиджетыОсновныеПоказатели.НомерСтроки = 1)
		|ГДЕ
		|	ГруппыВиджетовСхема.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВиджетыГруппы.Виджет КАК Виджет,
		|	ВиджетыГруппы.Виджет.Наименование КАК Наименование,
		|	ВиджетыГруппы.Виджет.Цвет КАК Цвет,
		|	ВиджетыГруппы.ПозицияСтроки КАК ПозицияСтроки,
		|	ВиджетыГруппы.ПозицияКолонки КАК ПозицияКолонки
		|ИЗ
		|	ВиджетыГруппы КАК ВиджетыГруппы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПозицияКолонки,
		|	ПозицияСтроки
		|ИТОГИ ПО
		|	ПозицияКолонки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВиджетыГруппы.Виджет.ПоказательЗаголовка.Шрифт КАК ПоказательЗаголовкаШрифт,
		|	ВиджетыГруппы.Показатель.Шрифт КАК ПоказательШрифт
		|ИЗ
		|	ВиджетыГруппы КАК ВиджетыГруппы";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаКолонка = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭлементГруппаКолонок = Элементы.Найти("ГруппаКолонок");
	
	Пока ВыборкаКолонка.Следующий() Цикл
		
		ГруппаКолонок = СоздатьГруппуКолонки(ЭлементГруппаКолонок, ВыборкаКолонка.ПозицияКолонки);
		Выборка = ВыборкаКолонка.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СоздатьВиджет(ГруппаКолонок, Выборка);
			
		КонецЦикла;
		
	КонецЦикла;
	
	ВыборкаШрифт = РезультатЗапроса[2].Выбрать();
	Если ВыборкаШрифт.Следующий() Тогда
		ШрифтЗаголовка = ВыборкаШрифт.ПоказательЗаголовкаШрифт.Получить();
		ШрифтДанных = ВыборкаШрифт.ПоказательШрифт.Получить();
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция СоздатьГруппуКолонки(Родитель, НомерКолонки)
	
	ИмяГруппы = "ГруппаКолонка" + НомерКолонки;
	СозданныйЭлемент = Элементы.Вставить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
	СозданныйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	СозданныйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	СозданныйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	СозданныйЭлемент.ОтображатьЗаголовок = Ложь;
	
	Возврат СозданныйЭлемент;
	
КонецФункции

&НаСервере
Процедура СоздатьВиджет(Родитель, ДанныеВиджета)
	
	ДобавляемыеРеквизиты = Новый Массив;
	ИмяГруппы = СтрШаблон("ГруппаСтрок%1_%2", ДанныеВиджета.ПозицияКолонки, ДанныеВиджета.ПозицияСтроки);
	СозданнаяГруппа = Элементы.Вставить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
	СозданнаяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	СозданнаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	СозданнаяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	СозданнаяГруппа.ОтображатьЗаголовок = Ложь;
	СозданнаяГруппа.ЦветФона = ДанныеВиджета.Цвет.Получить();
	СозданнаяГруппа.Ширина = 25;
	СозданнаяГруппа.Высота = 7;
	СозданнаяГруппа.ГоризонтальноеПоложениеПодчиненных = ГоризонтальноеПоложениеЭлемента.Центр;
	СозданнаяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	СозданнаяГруппа.РастягиватьПоГоризонтали = Ложь;
	
	ИмяНаименования = СтрШаблон("НаименованиеВиджета%1_%2", ДанныеВиджета.ПозицияКолонки, ДанныеВиджета.ПозицияСтроки);
	РеквизитНаименование = Новый РеквизитФормы(ИмяНаименования, ОбщегоНазначения.ОписаниеТипаСтрока(50),,,Истина);
	ДобавляемыеРеквизиты.Добавить(РеквизитНаименование);
	
	ИмяЦвета = СтрШаблон("ЦветВиджета%1_%2", ДанныеВиджета.ПозицияКолонки, ДанныеВиджета.ПозицияСтроки);
	РеквизитЦвет = Новый РеквизитФормы(ИмяЦвета, Новый ОписаниеТипов("Цвет"),,, Истина);
	ДобавляемыеРеквизиты.Добавить(РеквизитЦвет);
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	СозданноеПоле = Элементы.Вставить(ИмяНаименования, Тип("ПолеФормы"), СозданнаяГруппа);
	СозданноеПоле.Вид = ВидПоляФормы.ПолеВвода;
	СозданноеПоле.ПутьКДанным = ИмяНаименования;
	СозданноеПоле.Ширина = 22;
	СозданноеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СозданноеПоле.Подсказка = "Наименование";
	СозданноеПоле.ПодсказкаВвода = "Наименование";
	
	СозданноеПоле = Элементы.Вставить(ИмяЦвета, Тип("ПолеФормы"), СозданнаяГруппа);
	СозданноеПоле.Вид = ВидПоляФормы.ПолеВвода;
	СозданноеПоле.ПутьКДанным = ИмяЦвета;
	СозданноеПоле.Ширина = 20;
	СозданноеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	СозданноеПоле.Подсказка = "Цвет";
	СозданноеПоле.ПодсказкаВвода = "Цвет";
	СозданноеПоле.УстановитьДействие("ПриИзменении", "Подключаемый_ЦветВиджетаПриИзменении");
	
	ЭтотОбъект[ИмяНаименования] = ДанныеВиджета.Наименование;
	ЭтотОбъект[ИмяЦвета] = ДанныеВиджета.Цвет.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанные(Отказ)
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Виджеты");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ПоказателиВиджетов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыВиджетовСхема.Виджет КАК Виджет,
		|	ВиджетыОсновныеПоказатели.Показатель КАК Показатель,
		|	ГруппыВиджетовСхема.ПозицияСтроки КАК ПозицияСтроки,
		|	ГруппыВиджетовСхема.ПозицияКолонки КАК ПозицияКолонки
		|ПОМЕСТИТЬ ВиджетыГруппы
		|ИЗ
		|	Справочник.ГруппыВиджетов.Схема КАК ГруппыВиджетовСхема
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Виджеты.ОсновныеПоказатели КАК ВиджетыОсновныеПоказатели
		|		ПО ГруппыВиджетовСхема.Виджет = ВиджетыОсновныеПоказатели.Ссылка
		|			И (ВиджетыОсновныеПоказатели.НомерСтроки = 1)
		|ГДЕ
		|	ГруппыВиджетовСхема.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВиджетыГруппы.Виджет КАК Виджет,
		|	ВиджетыГруппы.ПозицияСтроки КАК ПозицияСтроки,
		|	ВиджетыГруппы.ПозицияКолонки КАК ПозицияКолонки,
		|	ВиджетыГруппы.Показатель КАК Показатель,
		|	ВиджетыГруппы.Виджет.ПоказательЗаголовка КАК ПоказательЗаголовка,
		|	ВиджетыГруппы.Виджет.ПоказательПодвала КАК ПоказательПодвала,
		|	ВиджетыГруппы.Виджет.Наименование КАК Наименование,
		|	ВиджетыГруппы.Виджет.Цвет КАК Цвет,
		|	ВиджетыГруппы.Показатель.Шрифт КАК ПоказательШрифт,
		|	ВиджетыГруппы.Виджет.ПоказательЗаголовка.Шрифт КАК ПоказательЗаголовкаШрифт,
		|	ВиджетыГруппы.Виджет.ПоказательПодвала.Шрифт КАК ПоказательПодвалаШрифт
		|ИЗ
		|	ВиджетыГруппы КАК ВиджетыГруппы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПозицияКолонки,
		|	ПозицияСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ШрифтДанныхХранилище = Новый ХранилищеЗначения(ШрифтДанных);
		ШрифтЗаголовкаХраналище = Новый ХранилищеЗначения(ШрифтЗаголовка);
		Пока Выборка.Следующий() Цикл
			
			ИмяНаименования = СтрШаблон("НаименованиеВиджета%1_%2", Выборка.ПозицияКолонки, Выборка.ПозицияСтроки);
			ИмяЦвета = СтрШаблон("ЦветВиджета%1_%2", Выборка.ПозицияКолонки, Выборка.ПозицияСтроки);
			
			ТекущийЦвет = Выборка.Цвет.Получить();
			Если Выборка.Наименование <> ЭтотОбъект[ИмяНаименования] Или ТекущийЦвет <> ЭтотОбъект[ИмяЦвета] Тогда
				Виджет = Выборка.Виджет.ПолучитьОбъект();
				Виджет.Наименование = ЭтотОбъект[ИмяНаименования];
				Виджет.Цвет = Новый ХранилищеЗначения(ЭтотОбъект[ИмяЦвета]);
				Виджет.Записать();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.Показатель) И Выборка.ПоказательШрифт.Получить() <> ШрифтДанных Тогда
				Показатель = Выборка.Показатель.ПолучитьОбъект();
				Показатель.Шрифт = ШрифтДанныхХранилище;
				Показатель.Записать();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ПоказательПодвала) И Выборка.ПоказательПодвалаШрифт.Получить() <> ШрифтДанных Тогда
				ПоказательПодвала = Выборка.ПоказательПодвала.ПолучитьОбъект();
				ПоказательПодвала.Шрифт = ШрифтДанныхХранилище;
				ПоказательПодвала.Записать();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ПоказательЗаголовка)
				И Выборка.ПоказательЗаголовкаШрифт.Получить() <> ШрифтЗаголовка Тогда
				
				ПоказательЗаголовка = Выборка.ПоказательЗаголовка.ПолучитьОбъект();
				ПоказательЗаголовка.Шрифт = ШрифтЗаголовкаХраналище;
				ПоказательЗаголовка.Записать();
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не удалось записать данные:%1%2'"), Символы.НПП, ОписаниеОшибки());
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Подключение к кластеру серверов'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеВиджета(НомерВиджета, Наименование, Цвет)
	
	ЗаполнитьРеквизитФормы("НаименованиеВиджета" + НомерВиджета, Наименование);
	ЗаполнитьРеквизитФормы("ЦветВиджета" + НомерВиджета, Цвет);
	
	Виджет = Элементы.Найти("ГруппаСтрок" + НомерВиджета);
	Если Виджет <> Неопределено Тогда
		Виджет.ЦветФона = Цвет;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитФормы(ИмяРеквизита, Значение)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЭтаФорма, ИмяРеквизита) Тогда
		ЭтаФорма[ИмяРеквизита] = Значение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
